[{"ProjectName":"Executive Member of Lavin – Social Committee","Description": "As an appointed executive committee member of a highly competitive entrepreneurship program, Lavin, I coordinated my team’s effort to increase member engagement by conducting the first ever winter Lavin Gala to keep the energy high throughout the year. Additionally, I improved collaboration and productivity by creating a forum where members can share entrepreneur ideas. Furthermore, I restructured teams to improve internal networking through targeted mentor-mentee assignments."},
{"ProjectName":"Seelig Research","Description": "During my undergraduate research, I used VisualDSD, a design and analysis tool created for programming and simulating DNA circuits, extensively to model Strand Displacement Amplification cascade experiments. I’ve frequently targeted and modified specific sequences. I made hypotheses about the most efficient configurations of DNA pairs to act in the capacity of programmable chemical controllers, constructed and tested them. I managed data sets to refine the controller and performed experiments to enable the controllers to accomplish a wide variety of tasks including targeted drug delivery, by enabling a localized high concentration of DNA strands, through a process called Strand Displacement Amplification and presented 8 weekly reports."},
{"ProjectName":"Vivint Sales Intern","Description": "I have gained client-facing skills working at Vivint Inc., who provides a technical solution for a practical problem; they protect families from intruders. During my demos I realized some gaps between the families’ desires and Vivint’s solutions. For example, in addition to the fire safety features, some families wanted outdoor cameras to monitor their young children while they played in the big yard. However, Vivint didn’t offer that product. They feared that outdoor sensors would send false alarms because they could not differentiate between the movements of children and small animals; Vivint only bundled sensors with indoor cameras. If Vivint unbundled, they could’ve provided an outdoor camera-only solution and alleviated the family’s concerns. I consolidated such product gaps from users’ perspectives and communicated this feedback to Vivint for future enhancements so they can protect more families."},
{"ProjectName":"Ntelligens","Description": "I have been working part time at Ntelligens, Inc. since Sep 2013. Ntelligens is an IT services provider serving clients in financial services industry, especially in Insurance. It offers consultants (own employees and from partners) to help clients meet their temporary need for experienced people to work on IT projects. My role as associate in Operations group is to interact with business development managers, consultants and clients. The two roles I was responsible for was analyzing cost data using Excel and coordinating the on-boarding process to ensure timely start of new employees through client communication and logistics. By understanding clients' business requirements from my business development manager, matching available consultant talent, (both internal and partner) and providing the list to BDM I recommended reallocation of human resources to low cost locations to increase profitability by 10% over 1 year. I performed the second task by closing the loop on both ends; I communicated with Ntelligens HR to ensure that all necessary legal paperwork was completed, including but not limited to work authorization and background checks and spoke to/emailed the BDM and the client (as needed) to understand the client specific induction formalities - like signing the non-compete clause, confidentiality agreement, providing SSN and other details to set up access in client systems, following up with clients on the allocation of laptop, badge, work location and contacts so that clients can start being productive from Day 1."},
{"ProjectName":"Entreprenurial History","Description": "From my high school days, I had always been looking for ways technology can be used to help people. During my freshman year, I won third place in the TYE Seattle 10K Business Plan competition for an interactive gamification of SAT Prep. Furthermore, I am pitching an app to teach public health education in low income areas for the March 2016 UW Health Innovation Challenge (HIC)."},
{"ProjectName":"Teaching Tamil","Description": "I’m really passionate about educating young people. I think that, as the first-generation child of immigrants, it’s easy to forget or de-emphasize the culture of our parents’ motherland. So I volunteered to teach my parents’ mother tongue, Tamil, to elementary schoolers through a cultural program called Balavihar. Developing new ways to keep the children engaged and teach the alphabet and grammar, while challenging, was ultimately very rewarding as they are preserving their culture in a very immediate way. They can decently converse with their relatives back home in their culturally-rich language. I am excited to perform the duties assigned to me during the internship, but also take the initiative to implement a solution using your software to tackle this problem of cultural invigoration and preservation from a different angle."}]